# Assignment 1:
### - The automated_stat_analyzer Function
- Scenario: A retail company needs a utility to quickly summarize sales data. Students must create a function that identifies the 
"Central Tendency" and "Dispersion" of any numerical column.
- ### Requirements:

* Accept a Pandas DataFrame and a column name.

* Calculate the Mean, Median, and Standard Deviation .

* Identify if the data is "Skewed" by comparing the Mean and Median.


* Bonus: If the column is categorical, return the Mode instead.

### Your Data

In [64]:
import pandas as pd
import numpy as np

# Create a synthetic Company Sales Dataset
data = {
    'Transaction_ID': range(1, 11),
    'Product_Category': ['Electronics', 'Home', 'Electronics', 'Sports', 'Home', 
                         'Electronics', 'Home', 'Sports', 'Electronics', 'Electronics'],
    'Sales_Amount': [150, 200, 155, 300, 210, 180, 205, 1000, 190, 160], # 1000 is an Outlier
    'Customer_Age': [25, 34, np.nan, 45, 23, 31, 29, np.nan, 38, 40],    # Contains Nulls (NaN)
    'Rating': [5, 4, 3, 5, 2, 4, 5, 2, 4, 3]
}

df_test = pd.DataFrame(data)

# Save to CSV for students to practice loading files [cite: 74]
df_test.to_csv('company_sales_test.csv', index=False)
print("Test dataset created successfully!")

Test dataset created successfully!

In [3]:
df_test.dtypes

Transaction_ID        int64
Product_Category     object
Sales_Amount          int64
Customer_Age        float64
Rating                int64
dtype: object

In [66]:
df_test.mode()

   Transaction_ID Product_Category  Sales_Amount  Customer_Age  Rating
0               1      Electronics           150          23.0     4.0
1               2              NaN           155          25.0     5.0
2               3              NaN           160          29.0     NaN
3               4              NaN           180          31.0     NaN
4               5              NaN           190          34.0     NaN
5               6              NaN           200          38.0     NaN
6               7              NaN           205          40.0     NaN
7               8              NaN           210          45.0     NaN
8               9              NaN           300           NaN     NaN
9              10              NaN          1000           NaN     NaN

In [ ]:
import pandas as pd
import numpy as np
def automated_stat_analyzer(df, column_name):
    """
    Company Task: Provide a summary report of a specific data variable.
    
    Instructions:
    1. Check if the column is numerical or categorical.
    2. For numerical: Calculate Mean, Median, and Standard Deviation.
    3. For categorical: Calculate the Mode.
    4. Return a dictionary with these statistical measures.
    """
    data = {'Transaction_ID': range(1, 11),
    'Product_Category': ['Electronics', 'Home', 'Electronics', 'Sports', 'Home', 
                         'Electronics', 'Home', 'Sports', 'Electronics', 'Electronics'],
    'Sales_Amount': [150, 200, 155, 300, 210, 180, 205, 1000, 190, 160], # 1000 is an Outlier
    'Customer_Age': [25, 34, np.nan, 45, 23, 31, 29, np.nan, 38, 40],    # Contains Nulls (NaN)
    'Rating': [5, 4, 3, 5, 2, 4, 5, 2, 4, 3]}
    # TODO: Implement using df[column_name].mean(), .median(), .std(), or .mode()  you can used Sales_Amount for your test case
    
    col = df[column_name]
    
    if col.dtype in ["float64", "int64"]:
        return {
            "Mean": col.mean(),
            "Median": col.median(),
            "Standard Deviation": col.std()
        }
    else:
        return f"Mode: {col.mode()[0]}"
data = {'Transaction_ID': range(1, 11),
    'Product_Category': ['Electronics', 'Home', 'Electronics', 'Sports', 'Home', 
                         'Electronics', 'Home', 'Sports', 'Electronics', 'Electronics'],
    'Sales_Amount': [150, 200, 155, 300, 210, 180, 205, 1000, 190, 160], # 1000 is an Outlier
    'Customer_Age': [25, 34, np.nan, 45, 23, 31, 29, np.nan, 38, 40],    # Contains Nulls (NaN)
    'Rating': [5, 4, 3, 5, 2, 4, 5, 2, 4, 3]}     
df = pd.DataFrame(data)

print("Sales_amount: ",automated_stat_analyzer(df,"Sales_Amount"))
automated_stat_analyzer(df, "Product_Category")

Sales_amount:  {'Mean': np.float64(275.0), 'Median': np.float64(195.0), 'Standard Deviation': np.float64(258.30645021412494)}

'Mode: Electronics'

## Assignment 2: 
  ### The null_handling_strategy Function

#### Scenario: Incoming user data often has missing values.Students must implement a flexible strategy to handle these "Null Values" to prepare data for Machine Learning.
### Requirements:

* Check for null values in the DataFrame.

* Apply a strategy based on parameters: "drop_rows", "fill_mean", or "fill_median" .

* Ensure the function only fills numerical columns when using mean or median.

In [116]:
def null_handling_strategy(df,column_name ,strategy="fill_mean"):
    """
    Company Task: Clean a dataset by resolving missing (NaN) values.
    """
    # TODO: Implement using df[column_name].mean(), .median(), .std(), or .mode()  you can used Sales_Amount for your test case
    

    col = df[column_name]

    if strategy == "fill_mean":
        if col.dtype in ["float64", "int64"]:
            df[column_name] = col.fillna(col.mean())
        return df

    elif strategy == "fill_median":
        if col.dtype in ["float64", "int64"]:
            df[column_name] = col.fillna(col.median())
        return df

    elif strategy == "drop_rows":
        return df.dropna(subset=column_name)
    raise ValueError(f"Something Went Wrong, Strategy {strategy} not recognized!!")

In [117]:
data = {'Sales_Amount': [100, np.nan, 1000, 150, np.nan]}
df_test = pd.DataFrame(data)
print(null_handling_strategy(df_test, 'Sales_Amount', strategy="fill_mean"))

   Sales_Amount
0    100.000000
1    416.666667
2   1000.000000
3    150.000000
4    416.666667

In [119]:
df

   Transaction_ID Product_Category  Sales_Amount  Customer_Age  Rating
0               1      Electronics           150          25.0       5
1               2             Home           200          34.0       4
2               3      Electronics           155           NaN       3
3               4           Sports           300          45.0       5
4               5             Home           210          23.0       2
5               6      Electronics           180          31.0       4
6               7             Home           205          29.0       5
7               8           Sports          1000           NaN       2
8               9      Electronics           190          38.0       4
9              10      Electronics           160          40.0       3

In [ ]:
null_handling_strategy(df, "Customer_Age", "drop_rows")

   Transaction_ID Product_Category  Sales_Amount  Customer_Age  Rating
0               1      Electronics           150          25.0       5
1               2             Home           200          34.0       4
3               4           Sports           300          45.0       5
4               5             Home           210          23.0       2
5               6      Electronics           180          31.0       4
6               7             Home           205          29.0       5
8               9      Electronics           190          38.0       4
9              10      Electronics           160          40.0       3